<details ><summary>apply for portal 2024-12-17 02:16:35 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/testing.pinner.xyz-devops#portal has been locked by PR #4
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Creating...
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Creating...
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service: Creation complete after 23s [id=19388214:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service: Creation complete after 30s [id=19388216:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.proxysql.module.proxysql_deployment.akash_deployment.service: Creating...
module.proxysql.module.proxysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.proxysql.module.proxysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.proxysql.module.proxysql_deployment.akash_deployment.service: Creation complete after 23s [id=19388219:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creation complete after 24s [id=19388223:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service: Creation complete after 30s [id=19388227:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creation complete after 24s [id=19388232:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```
</details>

</details>